function [x2] = SurrogateData(x1)
% 随机相位法产生替代数据

%--------------------------------------------------

[r,c] = size(x1);
if c>r
    x1 = x1';
end

%-----------------------------------------------------------------
% FFT变换

n = length(x1);
z1 = fft(x1);                        % 离散DFT

%-----------------------------------------------------------------
% 相位随机化

if mod(n,2)                         % 长度为奇数
    tmp = rand((n-1)/2,1);
    z2 = z1.*exp(i*2*pi*[0;tmp;-flipud(tmp)]);
else                                % 长度为偶数
    tmp = rand(n/2-1,1);
    z2 = z1.*exp(i*2*pi*[0;tmp;0;-flipud(tmp)]);    
end

%-----------------------------------------------------------------
% 逆FFT变换  

x2 = ifft(z2);



