%调用函数计算最大Lyapunov指数示例，刘老弟每次计算前只要按需要
%%修改里面的参数就可以了，将老弟
%%测得的数据填入data后面的中括号里，数字间用逗号（英文的）分开。

%下面是几个字母的含义：
% data为输入时间序列
% N为时间序列长度（也就是老弟一次实验记录的数据个数，也就是data后面中括号中数字的个数）
% m为嵌入空间维数
% tau为时间延迟
 %P:时间序列的平均周期,选择演化相点距当前点的位置差，即若当前相点为I，则演化相点只能在|I－J|>P的相点中搜寻

 
 % 输出值是最大Lyapunov指数
%data=[0.06,0.28,1.18,1.92,1.97,2.80,3.03,5.23,8.30,10.21,11.78,13.40,16.11,17.25,20.69,20.66,20.17,20.07,20.01,20.00,19.55,19.40];
%data=[0.06,0.28,1.18,1.92,1.97,2.80,3.03,5.23,8.30,10.21,11.78,13.40,16.11,17.25,20.69,20.66,20.17,20.07,20.01,20.00,19.55,19.40];
data=[0.06,0.14,0.88,1.12,1.17,2.00,2.53,4.23,6.30,8.21,9.78,10.40,12.11,13.25,14.69,15.66,15.17,15.07,15.01,15.00,14.55,14.48];
N=22;
m=17;
tau=1;
P=1;
lyapunov_wolf(data,N,m,tau,P)